
#Область ОбработчикСобытийФормы

&НаКлиенте
Процедура НоменклатураТЧНоменклатураПриИзменении(Элемент)
	ТекСтрокаТЧ = Элементы.НоменклатураТЧ.ТекущиеДанные;
	ТекСтрокаТЧ.ЕдИзм = ПолучитьЕдИзмНаСервере(ТекСтрокаТЧ.Номенклатура);
	//ТекСтрокаТЧ.Цена = ПолучитьЦенуНаСервере(Объект.Дата,ТекСтрокаТЧ.Номенклатура,Объект.Поставщик); 
	РасчетСуммыСтроки.СуммаСтрокиТЧ(ТекСтрокаТЧ);
КонецПроцедуры 

Функция ПолучитьЕдИзмНаСервере(Номенклатура)
	 Возврат Номенклатура.ЕдИзм;
КонецФункции

&НаКлиенте
Процедура НоменклатураТЧКоличествоПриИзменении(Элемент)
    ТекСтрокаТЧ = Элементы.НоменклатураТЧ.ТекущиеДанные;
	РасчетСуммыСтроки.СуммаСтрокиТЧ(ТекСтрокаТЧ);
КонецПроцедуры

#КонецОбласти