
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Производство.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Производство.Дата,
	|	Производство.ЗаказКлиента,
	|	Производство.Изделие,
	|	Производство.Номер,
	|	Производство.Потребность,
	|	Производство.Спецификация,
	|	Производство.Материалы.(
	|		НомерСтроки,
	|		ТипНоменклатуры,
	|		Материал,
	|		ИзСпецификации,
	|		ЕдИзм,
	|		Количество
	|	),
	|	Производство.Операции.(
	|		НомерСтроки,
	|		Спецификация,
	|		РабочееМесто,
	|		Операция,
	|		НормаВремени,
	|		КоличествоОпераций,
	|		Нормочасы
	|	)
	|ИЗ
	|	Документ.Производство КАК Производство
	|ГДЕ
	|	Производство.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМатериалыШапка = Макет.ПолучитьОбласть("МатериалыШапка");
	ОбластьМатериалы = Макет.ПолучитьОбласть("Материалы");
	ОбластьОперацииШапка = Макет.ПолучитьОбласть("ОперацииШапка");
	ОбластьОперации = Макет.ПолучитьОбласть("Операции");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьМатериалыШапка);
		ВыборкаМатериалы = Выборка.Материалы.Выбрать();
		Пока ВыборкаМатериалы.Следующий() Цикл
			ОбластьМатериалы.Параметры.Заполнить(ВыборкаМатериалы);
			ТабДок.Вывести(ОбластьМатериалы, ВыборкаМатериалы.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьОперацииШапка);
		ВыборкаОперации = Выборка.Операции.Выбрать();
		Пока ВыборкаОперации.Следующий() Цикл
			ОбластьОперации.Параметры.Заполнить(ВыборкаОперации);
			ТабДок.Вывести(ОбластьОперации, ВыборкаОперации.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
