
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказВМастерскую") Тогда
		// Заполнение шапки
		Изделие = ДанныеЗаполнения.Изделие;
		ЗаказКлиента = ДанныеЗаполнения.ЗаказКлиента;
		Потребность = ДанныеЗаполнения.Потребность;
		Спецификация = ДанныеЗаполнения.Спецификация;
		Для Каждого ТекСтрокаМатериалы Из ДанныеЗаполнения.Материалы Цикл
			Если ТекСтрокаМатериалы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал Тогда
				НоваяСтрока = Материалы.Добавить();
				НоваяСтрока.ЕдИзм = ТекСтрокаМатериалы.ЕдИзм;
				НоваяСтрока.ИзСпецификации = ТекСтрокаМатериалы.ИзСпецификации;
				НоваяСтрока.Количество = ТекСтрокаМатериалы.Количество;
				НоваяСтрока.Материал = ТекСтрокаМатериалы.Материал;
				НоваяСтрока.ТипНоменклатуры = ТекСтрокаМатериалы.ТипНоменклатуры;			
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекСтрокаОперации Из ДанныеЗаполнения.Операции Цикл
			НоваяСтрока = Операции.Добавить();
			НоваяСтрока.КоличествоОпераций = ТекСтрокаОперации.КоличествоОпераций;
			НоваяСтрока.НормаВремени = ТекСтрокаОперации.НормаВремени;
			НоваяСтрока.Нормочасы = ТекСтрокаОперации.Нормочасы;
			НоваяСтрока.Операция = ТекСтрокаОперации.Операция;
			НоваяСтрока.РабочееМесто = ТекСтрокаОперации.РабочееМесто;
			НоваяСтрока.Спецификация = ТекСтрокаОперации.Спецификация;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ПроизводствоИзделий Расход
	Движения.ПроизводствоИзделий.Записывать = Истина;
	Движение = Движения.ПроизводствоИзделий.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Изделие = Изделие;
	Движение.Спецификация = Спецификация;
	Движение.ЗаказКлиента = ЗаказКлиента;
	Движение.ПроизводствоИзделия = Ссылка;
	Движение.Количество = Потребность;

	// регистр ОстаткиМатериалов Расход 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводствоМатериалы.Материал КАК Материал,
		|	СУММА(ПроизводствоМатериалы.Количество) КАК Количество
		|ПОМЕСТИТЬ Док
		|ИЗ
		|	Документ.Производство.Материалы КАК ПроизводствоМатериалы
		|ГДЕ
		|	ПроизводствоМатериалы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроизводствоМатериалы.Материал
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиМатериаловОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиМатериаловОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиМатериаловОстатки.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ Рег
		|ИЗ
		|	РегистрНакопления.ОстаткиМатериалов.Остатки(&Дата, ) КАК ОстаткиМатериаловОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Док.Материал КАК Материал,
		|	Док.Количество КАК Количество,
		|	ЕСТЬNULL(Рег.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	Док.Количество / Рег.КоличествоОстаток * Рег.СуммаОстаток КАК Сумма
		|ИЗ
		|	Док КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ Рег КАК Рег
		|		ПО Док.Материал = Рег.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
			Сообщить("Мало материалов " + Выборка.Материал + ",не хватает "
			+ (Выборка.Количество - Выборка.КоличествоОстаток));
			Отказ = Истина;
		КонецЕсли;
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
	КонецЦикла; 
	
	тз_Материалы = РезультатЗапроса.Выгрузить();
	Движения.ОстаткиМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из тз_Материалы Цикл
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаМатериалы.Материал;
        Движение.Количество = ТекСтрокаМатериалы.Количество;
		Движение.Сумма = ТекСтрокаМатериалы.Сумма; 
	КонецЦикла;
КонецПроцедуры
