
#Область ОбработчикСобытийФормы
 
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ДобавитьСсылкуВЗаказКлиентаНаСервере(Объект.ЗаказКлиента);	
КонецПроцедуры

Процедура 	ДобавитьСсылкуВЗаказКлиентаНаСервере(ЗаказКлиента)
	ДокЗаказКлиентаОбъект = ЗаказКлиента.ПолучитьОбъект();
	Для каждого СтрЗаказанныеИзделия Из ДокЗаказКлиентаОбъект.ЗаказанныеИзделия Цикл
	    Если Объект.Спецификация = СтрЗаказанныеИзделия.Спецификация Тогда
		   СтрЗаказанныеИзделия.Производство = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	ДокЗаказКлиентаОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

#КонецОбласти