//комментарий пример
&НаКлиенте
Процедура ЗаказанныеИзделияПриИзменении(Элемент)
	ТекСтрокаТЧ = Элементы.ЗаказанныеИзделия.ТекущиеДанные;
	РасчетСуммыСтроки.СуммаСтрокиТЧ(ТекСтрокаТЧ);
КонецПроцедуры 

&НаКлиенте
Процедура ЗаказанныеИзделияСпецификацияПриИзменении(Элемент)
	ТекСтрокаТЧ = Элементы.ЗаказанныеИзделия.ТекущиеДанные;
	ТекСтрокаТЧ.Цена = ПолучитьЦенуНаСервере(ТекСтрокаТЧ.Изделие, ТекСтрокаТЧ.Спецификация);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНаСервере(Изделие,Спецификация)
	РегПрайслист = РегистрыСведений.Прайслист.ПолучитьПоследнее(ТекущаяДата(),Новый Структура ("Изделие, Спецификация", Изделие, Спецификация));
	Возврат РегПрайслист.Цена;
Конецфункции
//Привет, я Наташа! Что-то написала хихи 02.06.25
&НаКлиенте
Процедура ЗаказанныеИзделияКоличествоПриИзменении(Элемент)
	ТекСтрокаТЧ = Элементы.ЗаказанныеИзделия.ТекущиеДанные;
	РасчетСуммыСтроки.СуммаСтрокиТЧ(ТекСтрокаТЧ);
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Состояние = Перечисления.СостояниеЗаказов.ПустаяСсылка() Тогда
		Объект.Состояние = Перечисления.СостояниеЗаказов.Заказан;
	КонецЕсли;
КонецПроцедуры

#Область Команды

&НаКлиенте
Процедура Подбор(Команда)
	АдресИзделийВХранилище = ПоместитьИзделияВХранилище();
	ПараметрыПодбора = Новый Структура("АдресИзделийВХранилище", АдресИзделийВХранилище);
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораИзделий",ПараметрыПодбора,ЭтаФорма);
КонецПроцедуры
Функция ПоместитьИзделияВХранилище()
	Возврат ПоместитьВоВременноеХранилище(Объект.ЗаказанныеИзделия.Выгрузить(),
											УникальныйИдентификатор);
КонецФункции
#КонецОбласти

 &НаКлиенте
 Процедура ОчиститьТЧ() Экспорт
	 Объект.ЗаказанныеИзделия.Очистить();
 КонецПроцедуры 
 
 &НаКлиенте
 Процедура ОбработкаПодбора(Изделие,Спецификация,Количество,Цена,Сумма) Экспорт
 	СтрокаЗаказанныеИзделия              = Объект.ЗаказанныеИзделия.Добавить();
 	СтрокаЗаказанныеИзделия.Изделие        = Изделие;
 	СтрокаЗаказанныеИзделия.Спецификация = Спецификация;
 	СтрокаЗаказанныеИзделия.Количество   = Количество;
 	СтрокаЗаказанныеИзделия.Цена         = Цена;	
 	СтрокаЗаказанныеИзделия.Сумма        = Сумма;
 КонецПроцедуры
 
 
 