// 
//   &НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//    
//    Если ЭтоАдресВременногоХранилища(Изображение) Тогда
//        ТекущийОбъект.Изображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Изображение));
//    КонецЕсли;
//    
//КонецПроцедуры
//  
//  &НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//    
//    Изображение = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Изображение");
//    
//КонецПроцедуры     

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьИзображение();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИзображение()
	
	// Конвертируем объект формы в объект справочника, чтобы 
	//можно было работать с реквизитом типа "Хранилище значений"
	ОбъектЭлемента = РеквизитФормыВЗначение("Объект");	
	
	// Помещаем двоичные данные из реквизита во временное хранилище. 
	//Адрес из хранилища помещаем в строковой реквизит
	// формы "Фото сотрудника"
	Изображение = ПоместитьВоВременноеХранилище(ОбъектЭлемента.Изображение.Получить(), 
												   УникальныйИдентификатор);
	
КонецПроцедуры
 

 &НаКлиенте
Процедура ЗагрузитьКартинку(Команда)
    
    Оповещение = Новый ОписаниеОповещения("ЗагрузитьКартинкуЗавершение", ЭтотОбъект);
    НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор);
    
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
    
    Если НЕ Результат Тогда
        Возврат;
    КонецЕсли;
    
    Изображение = Адрес;
    Модифицированность = Истина;
    
КонецПроцедуры  

 
 
