
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Реализация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Дата,
	|	Реализация.ЗаказКлиента,
	|	Реализация.Клиент,
	|	Реализация.Номер,
	|	Реализация.ЗаказанныеИзделия.(
	|		НомерСтроки,
	|		Изделие,
	|		Спецификация,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаказанныеИзделияШапка = Макет.ПолучитьОбласть("ЗаказанныеИзделияШапка");
	ОбластьЗаказанныеИзделия = Макет.ПолучитьОбласть("ЗаказанныеИзделия");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьЗаказанныеИзделияШапка);
		ВыборкаЗаказанныеИзделия = Выборка.ЗаказанныеИзделия.Выбрать();
		Пока ВыборкаЗаказанныеИзделия.Следующий() Цикл
			ОбластьЗаказанныеИзделия.Параметры.Заполнить(ВыборкаЗаказанныеИзделия);
			ТабДок.Вывести(ОбластьЗаказанныеИзделия, ВыборкаЗаказанныеИзделия.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
