#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура СоставНоменклатураПриИзменении(Элемент)
	СтрокаТчСостав = Элементы.Состав.ТекущиеДанные;
	СтрокаТЧСостав.Тип = ПолучитьТипНаСервере(СтрокаТЧСостав.Номенклатура);
	СтрокаТЧСостав.ЕдИзм = ПолучитьЕдИзмНаСервере(СтрокаТЧСостав.Номенклатура);
	СтрокаТЧСостав.Спецификация = ПолучитьСпецНаСервере(СтрокаТЧСостав.Номенклатура);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипНаСервере(Номенклатура)
	Возврат Номенклатура.ТипНоменклатуры;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЕдИзмНаСервере(Номенклатура)
	Возврат Номенклатура.ЕдИзм;	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСпецНаСервере(Номенклатура)
	СпрСпец = Справочники.Спецификации.Выбрать(Номенклатура);
	СпрСпец.Следующий();
	Возврат СпрСпец.Ссылка;
КонецФункции

#КонецОбласти