
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗаказыКлиентов Приход
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Для Каждого ТекСтрокаЗаказанныеИзделия Из ЗаказанныеИзделия Цикл
		Движение = Движения.ЗаказыКлиентов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗаказКлиента = Ссылка;
		Движение.Номенклатура = ТекСтрокаЗаказанныеИзделия.Изделие;
		Движение.Спецификация = ТекСтрокаЗаказанныеИзделия.Спецификация;
		Движение.Количество = ТекСтрокаЗаказанныеИзделия.Количество;
		Движение.Сумма = ТекСтрокаЗаказанныеИзделия.Сумма;
	КонецЦикла;

	// регистр ПроизводствоИзделий Приход
	Движения.ПроизводствоИзделий.Записывать = Истина;
	Для Каждого ТекСтрокаЗаказанныеИзделия Из ЗаказанныеИзделия Цикл
		Движение = Движения.ПроизводствоИзделий.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Изделие = ТекСтрокаЗаказанныеИзделия.Изделие;
		Движение.Спецификация = ТекСтрокаЗаказанныеИзделия.Спецификация;
		Движение.ЗаказКлиента = Ссылка;
		Движение.Количество = ТекСтрокаЗаказанныеИзделия.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
