#Область ВыборЗначенийИзСписка
&НаКлиенте
Процедура ПрайслистВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтрокаУжеЕсть = ТипЗнч("Булево");
	СтрокаУжеЕсть = Ложь;
	Спецификация = ПолучитьСпецификацию(Значение);
	Если НЕ Корзина.Количество() = 0 Тогда
		Для каждого СтрКорзина Из Корзина Цикл
			Если СтрКорзина.Спецификация = Спецификация Тогда
				СтрокаУжеЕсть = Истина;
			КонецЕсли;
		КонецЦикла;
		Если СтрокаУжеЕсть Тогда
			СтрКорзина = Корзина.НайтиСтроки (Новый Структура ("Спецификация", Спецификация))[0];
			СтрКорзина.Количество = СтрКорзина.Количество + 1;
			СтрКорзина.Сумма = СтрКорзина.Количество * СтрКорзина.Цена;
		Иначе
			ПрайслистВыборЗначенияФрагмент(Значение);
		КонецЕсли;
	Иначе
		ПрайслистВыборЗначенияФрагмент(Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрайслистВыборЗначенияФрагмент(Знач Значение)
	
   Перем СтрокаКорзина;
   
   СтрокаКорзина = Корзина.Добавить();
   СтрокаКорзина.Изделие = ПолучитьИзделие(Значение);
   СтрокаКорзина.Спецификация = ПолучитьСпецификацию(Значение);
   СтрокаКорзина.Количество = 1;
   СтрокаКорзина.Цена = ПолучитьЦену(Значение);
   СтрокаКорзина.Сумма = СтрокаКорзина.Количество * СтрокаКорзина.Цена;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИзделие(Значение)
	Возврат Значение.Изделие;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСпецификацию(Значение)
	Возврат Значение.Спецификация;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЦену(Значение)
	РегПрайслист = РегистрыСведений.Прайслист.ПолучитьПоследнее(ТекущаяДата (),
	Новый Структура ("Изделие, Спецификация", Значение.Изделие, Значение.Спецификация));
	Возврат РегПрайслист.Цена;
КонецФункции 

&НаКлиенте
Процедура КорзинаКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Корзина.ТекущиеДанные;
	РасчетСуммыСтроки.СуммаСтрокиТЧ(СтрокаТЧ);
КонецПроцедуры	


#КонецОбласти

#Область ОткрытияЗакрытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Корзина.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресИзделийВХранилище));	
КонецПроцедуры	

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ВладелецФормы.ОчиститьТЧ();
	Для каждого СтрокаКорзина Из Корзина Цикл
		ВладелецФормы.ОбработкаПодбора(СтрокаКорзина.Изделие, СтрокаКорзина.Спецификация,
		СтрокаКорзина.Количество,СтрокаКорзина.Цена, СтрокаКорзина.Сумма);
	КонецЦикла;
	Закрыть();
КонецПроцедуры
#КонецОбласти

