#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура НачальнаяДатаПриИзменении(Элемент)
	ПараметрНачДата = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрНачДата.Использование = Истина;
	ПараметрНачДата.Значение = Отчет.НачальнаяДата;
КонецПроцедуры 

&НаКлиенте
Процедура КонечнаяДатаПриИзменении(Элемент)
	ПараметрКонДата = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрКонДата.Использование = Истина;
	ПараметрКонДата.Значение = Отчет.КонечнаяДата;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.НачальнаяДата = Параметры.НачальнаяДата;
	Отчет.КонечнаяДата = Параметры.КонечнаяДата;	
    АвтоОтображениеСостояния = РежимАвтоОтображенияСостояния.НеОтображать;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПараметрНачДата = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрНачДата.Использование = Истина;
	ПараметрНачДата.Значение = Отчет.НачальнаяДата;
	ПараметрКонДата = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрКонДата.Использование = Истина;
	ПараметрКонДата.Значение = Отчет.КонечнаяДата;
	СформироватьОтчетНаСервере();	
КонецПроцедуры

Процедура СформироватьОтчетНаСервере()
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	ЭтотОтчет.СкомпоноватьРезультат(Результат);
КонецПроцедуры

#КонецОбласти