#Область Команды

//&НаКлиенте
//Процедура ЗаполнитьТЧ(Команда)
//    Объект.Материалы.Очистить();
//	Объект.Операции.Очистить();
//	ЗаполнитьМатериалыНаСервере();
//	ЗаполнитьОперацииНаСервере();
//КонецПроцедуры

Процедура ЗаполнитьМатериалыНаСервере()Экспорт
     ТЗ_СоставИзделия = Новый ТаблицаЗначений;
	 ТЗ_СоставИзделия.Колонки.Добавить("ТипНоменклатуры");
	 ТЗ_СоставИзделия.Колонки.Добавить("Спецификация");
	 ТЗ_СоставИзделия.Колонки.Добавить("Материал");
	 ТЗ_СоставИзделия.Колонки.Добавить("ЕдИзм");
	 ТЗ_СоставИзделия.Колонки.Добавить("ИзСпецификации");
	 ТЗ_СоставИзделия.Колонки.Добавить("Количество");
	 
	 Если НЕ ПустаяСтрока(Объект.Спецификация) Тогда
		 Для каждого СтрСостав Из Объект.Спецификация.Состав Цикл
			 СтрокаТЗ 				  = ТЗ_СоставИзделия.Добавить();
			 СтрокаТЗ.ТипНоменклатуры = СтрСостав.Тип;
			 СтрокаТЗ.Спецификация 	  = СтрСостав.Спецификация;
			 СтрокаТЗ.Материал 		  = СтрСостав.Номенклатура;
			 СтрокаТЗ.ИзСпецификации  = Объект.Спецификация;
			 СтрокаТЗ.ЕдИзм 		  = СтрСостав.ЕдИзм;
			 СтрокаТЗ.Количество 	  = СтрСостав.Количество;	
		 КонецЦикла;
	 ЗаполнитьТЧМатериалы(ТЗ_СоставИзделия);
	 КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьТЧМатериалы(ТЗ_СоставИзделия)
	Для каждого СтрТЗ_СоставИзделия Из ТЗ_СоставИзделия Цикл
	 	СтрМатериалы 				  = Объект.Материалы.Добавить();
		СтрМатериалы.ТипНоменклатуры  = СтрТЗ_СоставИзделия.ТипНоменклатуры;
		СтрМатериалы.Спецификация 	  = СтрТЗ_СоставИзделия.Спецификация;
		СтрМатериалы.Материал 		  = СтрТЗ_СоставИзделия.Материал;
		СтрМатериалы.ИзСпецификации   = СтрТЗ_СоставИзделия.ИзСпецификации;
		СтрМатериалы.ЕдИзм 		      = СтрТЗ_СоставИзделия.ЕдИзм;
		СтрМатериалы.Количество 	  = СтрТЗ_СоставИзделия.Количество;	
		Если НЕ ПустаяСтрока(СтрТЗ_СоставИзделия.Спецификация)  Тогда
		    ТЗ_СоставИзделия = Новый ТаблицаЗначений;
		ТЗ_СоставИзделия.Колонки.Добавить("ТипНоменклатуры");
		ТЗ_СоставИзделия.Колонки.Добавить("Спецификация");
		ТЗ_СоставИзделия.Колонки.Добавить("Материал");
		ТЗ_СоставИзделия.Колонки.Добавить("ЕдИзм");
		ТЗ_СоставИзделия.Колонки.Добавить("ИзСпецификации");
		ТЗ_СоставИзделия.Колонки.Добавить("Количество");
		    Для каждого СтрСостав Из СтрТЗ_СоставИзделия.Спецификация.Состав Цикл
			 	СтрокаТЗ 				  = ТЗ_СоставИзделия.Добавить();
			 	СтрокаТЗ.ТипНоменклатуры  = СтрСостав.Тип;
			 	СтрокаТЗ.Спецификация 	  = СтрСостав.Спецификация;
			 	СтрокаТЗ.Материал 		  = СтрСостав.Номенклатура;
			 	СтрокаТЗ.ИзСпецификации   = СтрТЗ_СоставИзделия.Спецификация;
			 	СтрокаТЗ.ЕдИзм 		      = СтрСостав.ЕдИзм;
			 	СтрокаТЗ.Количество 	  = СтрСостав.Количество;	
			КонецЦикла;
			ЗаполнитьТЧМатериалы(ТЗ_СоставИзделия);
		КонецЕсли;
	КонецЦикла;		 
КонецПроцедуры

Процедура ЗаполнитьОперацииНаСервере()Экспорт
	Для каждого СтрОбъектСпецификацияОперации Из Объект.Спецификация.Операции Цикл
	    СтрТЧОперации 					 = Объект.Операции.Добавить();
		СтрТЧОперации.Спецификация 		 = Объект.Спецификация;
		СтрТЧОперации.РабочееМесто		 = СтрОбъектСпецификацияОперации.РабочееМесто;
		СтрТЧОперации.Операция 			 = СтрОбъектСпецификацияОперации.Операция;
		СтрТЧОперации.НормаВремени 		 = СтрОбъектСпецификацияОперации.НормаВремени;
		СтрТЧОперации.КоличествоОпераций = Объект.Потребность;
		СтрТЧОперации.Нормочасы 		 = СтрТЧОперации.НормаВремени * СтрТЧОперации.КоличествоОпераций;
	КонецЦикла;
	Для каждого СтрМатериалы Из Объект.Материалы Цикл
	   Если НЕ ПустаяСтрока(СтрМатериалы.Спецификация) Тогда
	       	Для каждого СтрСпецификацияОперации Из СтрМатериалы.Спецификация.Операции Цикл
	    		СтрТЧОперации 					 = Объект.Операции.Добавить();
				СтрТЧОперации.Спецификация 		 = СтрМатериалы.Спецификация;
				СтрТЧОперации.РабочееМесто		 = СтрСпецификацияОперации.РабочееМесто;
				СтрТЧОперации.Операция 			 = СтрСпецификацияОперации.Операция;
				СтрТЧОперации.НормаВремени 		 = СтрСпецификацияОперации.НормаВремени;
				СтрТЧОперации.КоличествоОпераций = Объект.Потребность;
				СтрТЧОперации.Нормочасы 		 = СтрТЧОперации.НормаВремени * СтрТЧОперации.КоличествоОпераций;
			КонецЦикла;
	   КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ЗаказВМастерскую",Объект.ЗаказКлиента,Объект.Ссылка);
КонецПроцедуры 

#КонецОбласти
